Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: // Client-specific labelers const client = new Client(session, { labelers: ['did:plc:labeler3'], })
ja: // Clientインスタンス固有のラベラー const client = new Client(session, { labelers: ['did:plc:labeler3'], })

source: // Construct & validate their status record const record = { $type: 'xyz.statusphere.status', status: req.body?.status, createdAt: new Date().toISOString(), } if (!Status.validateRecord(record).success) { return res.status(400).json({ error: 'Invalid status' }) }
ja: // ステータスレコードを構築して検証 const record = { $type: 'xyz.statusphere.status', status: req.body?.status, createdAt: new Date().toISOString(), } if (!Status.validateRecord(record).success) { return res.status(400).json({ error: 'Invalid status' }) }

source: // Construct their status record const record = { $type: 'xyz.statusphere.status', status: req.body?.status, createdAt: new Date().toISOString(), }
ja: // ステータスレコードを構築します const record = { $type: 'xyz.statusphere.status', status: req.body?.status, createdAt: new Date().toISOString(), }

source: // Create a session async function login() { const service = process.env.BOT_PDS! const identifier = process.env.BOT_HANDLE! const password = process.env.BOT_PASSWORD! const session = await PasswordSession.login({ service, // eg 'https://bsky.social' identifier, // eg 'alice.bsky.social' password, })
ja: // セッション生成 async function login() { const service = process.env.BOT_PDS! const identifier = process.env.BOT_HANDLE! const password = process.env.BOT_PASSWORD! const session = await PasswordSession.login({ service, // eg 'https://bsky.social' identifier, // eg 'alice.bsky.social' password, })

source: // Create an unauthenticated client instance const client = new Client('https://public.api.bsky.app')
ja: // 認証無しのクライアントインスタンスを作成 const client = new Client('https://public.api.bsky.app')

source: // Exchange code for session const { session } = await client.callback(params);
ja: // コードを交換してセッション取得 const { session } = await client.callback(params);

source: // Fetch additional information about the logged-in user const { data: profileRecord } = await agent.com.atproto.repo.getRecord({ repo: agent.assertDid, // our user's repo collection: 'app.bsky.actor.profile', // the bluesky profile record type rkey: 'self', // the record's key })
ja: // ログインしたユーザーに関する追加情報を取得します const { data: profileRecord } = await agent.com.atproto.repo.getRecord({ repo: agent.assertDid, // ユーザーのリポジトリ collection: 'app.bsky.actor.profile', // blueskyプロフィールを表すレコード型 rkey: 'self', // レコードのキー })

source: // Fetch data stored in our SQLite const statuses = await db .selectFrom('status') .selectAll() .orderBy('indexedAt', 'desc') .limit(10) .execute()
ja: // SQLiteに保存されているデータを取得します const statuses = await db .selectFrom('status') .selectAll() .orderBy('indexedAt', 'desc') .limit(10) .execute()

source: // Get the post that mentioned us const post = await client.call(app.bsky.feed.getPostThread, { uri: notif.uri, })
ja: // メンション元の投稿を取得 const post = await client.call(app.bsky.feed.getPostThread, { uri: notif.uri, })

source: // Global app-level labelers Client.configure({ appLabelers: ['did:plc:labeler1', 'did:plc:labeler2'], })
ja: // アプリレベルのグローバルなラベラー Client.configure({ appLabelers: ['did:plc:labeler1', 'did:plc:labeler2'], })

source: // Handle account/identity changes if (evt.type === "identity") { if (evt.status === "deleted") { await deleteAccount(evt.did); } else { await upsertAccount({ did: evt.did, handle: evt.handle, active: evt.isActive ? 1 : 0, }); } }
ja: // アカウント/IDの変更を処理 if (evt.type === "identity") { if (evt.status === "deleted") { await deleteAccount(evt.did); } else { await upsertAccount({ did: evt.did, handle: evt.handle, active: evt.isActive ? 1 : 0, }); } }

source: // Handle status record changes if (evt.type === "record") { const uri = AtUri.make(evt.did, evt.collection, evt.rkey);
ja: // ステータスレコードの変更を処理 if (evt.type === "record") { const uri = AtUri.make(evt.did, evt.collection, evt.rkey);

source: // Helper to update which status is "current" for a user (inside a transaction) async function setCurrStatus(tx: Transaction<DatabaseSchema>, did: string) { // Clear current flag for all user's statuses await tx .updateTable("status") .set({ current: 0 }) .where("authorDid", "=", did) .where("current", "=", 1) .execute(); // Set the most recent status as current await tx .updateTable("status") .set({ current: 1 }) .where("uri", "=", (qb) => qb .selectFrom("status") .select("uri") .where("authorDid", "=", did) .orderBy("createdAt", "desc") .limit(1), ) .execute(); } ```
ja: // ユーザーのステータスを最新に更新するヘルパー（トランザクション内) async function setCurrStatus(tx: Transaction<DatabaseSchema>, did: string) { // 全ユーザーのステータスの最新フラグをクリア await tx .updateTable("status") .set({ current: 0 }) .where("authorDid", "=", did) .where("current", "=", 1) .execute(); // 直近のステータスを最新に設定 await tx .updateTable("status") .set({ current: 1 }) .where("uri", "=", (qb) => qb .selectFrom("status") .select("uri") .where("authorDid", "=", did) .orderBy("createdAt", "desc") .limit(1), ) .execute(); } ```

source: // If the write is a valid status update if ( evt.collection === 'xyz.statusphere.status' && Status.isRecord(record) && Status.validateRecord(record).success ) { // Store the status // TODO } } }, }) ```
ja: // 書き込みが有効なステータス更新である場合 if ( evt.collection === 'xyz.statusphere.status' && Status.isRecord(record) && Status.validateRecord(record).success ) { // ステータスを保存する // TODO } } }, }) ```

source: // In Home function: const accountStatus = session ? await getAccountStatus(session.did) : null;
ja: // ホーム機能で使用 const accountStatus = session ? await getAccountStatus(session.did) : null;

source: // Make authenticated API calls console.log('Logged in as:', agent.did) ``` </TabPanel> <TabPanel value="go"> Once you have an authed `client`, you can store auth info and make API calls:
ja: // 認証付きでAPIを呼び出す console.log('Logged in as:', agent.did) ``` </TabPanel> <TabPanel value="go"> ログインした`client`が取得できたら、認証情報を入力してAPIを呼び出します。

source: // Map user DIDs to their domain-name handles const didHandleMap = await resolver.resolveDidsToHandles( statuses.map((s) => s.authorDid) )
ja: // ユーザーのDIDをドメイン名のハンドルにマップします const didHandleMap = awaitresolver.resolveDidsToHandles( statuses.map((s) => s.authorDid) )

source: // Redirect to authorization server window.location.href = data.redirectUrl; } catch (err) { setError(err instanceof Error ? err.message : "Login failed"); setLoading(false); } }
ja: // 認可サーバーにリダイレクト window.location.href = data.redirectUrl; } catch (err) { setError(err instanceof Error ? err.message : "Login failed"); setLoading(false); } }

source: // Replace all labelers client.setLabelers(['did:plc:labeler5'])
ja: // すべてのラベラーを置き換える client.setLabelers(['did:plc:labeler5'])

source: // Reply to the post await client.create(app.bsky.feed.post, { text: reply, createdAt: new Date().toISOString(), reply: { root: { uri: notif.uri, cid: post.thread.post.cid }, parent: { uri: notif.uri, cid: post.thread.post.cid }, }, })
ja: // 投稿にリプライ await client.create(app.bsky.feed.post, { text: reply, createdAt: new Date().toISOString(), reply: { root: { uri: notif.uri, cid: post.thread.post.cid }, parent: { uri: notif.uri, cid: post.thread.post.cid }, }, })

source: // Resolves handle, finds their auth server, returns authorization URL const authUrl = await client.authorize(handle, { scope: SCOPE, });
ja: // ハンドルを解決し、認可サーバーを見つけ、認可URLを返す const authUrl = await client.authorize(handle, { scope: SCOPE, });

source: // Send them back to the app return res.redirect('/') }) ) ```
ja: // アプリに送り返します return res.redirect('/') }) ) ```

source: // Serve the logged-in view return res .type('html') .send(page(home({ profile: profileRecord.value || {} }))) }) ) ```
ja: // ログインビューを提供する return res .type('html') .send(page(home({ profile: profileRecord.value || {} }))) }) ) ```

source: // Serves the public keys for the OAuth client // Required for confidential clients using private_key_jwt authentication
ja: // OAuthクライアントの公開鍵を配信する // private_key_jwtを使う機密クライアントでは必須

source: // Set DID cookie response.cookies.set("did", session.did, { httpOnly: true, secure: process.env.NODE_ENV === "production", sameSite: "lax", maxAge: 60 * 60 * 24 * 7, // 1 week path: "/", });
ja: // DIDクッキーを設定 response.cookies.set("did", session.did, { httpOnly: true, secure: process.env.NODE_ENV === "production", sameSite: "lax", maxAge: 60 * 60 * 24 * 7, // 1 week path: "/", });

source: // Start making requests using generated schemas const response = await client.call(app.bsky.actor.getProfile, { actor: 'pfrazee.com', }) ```
ja: // 生成されたスキーマを使用してリクエストの作成を開始する const response = await client.call(app.bsky.actor.getProfile, { actor: 'pfrazee.com', }) ```

source: // The URL of this endpoint IS your client_id // Authorization servers fetch this to learn about your app
ja: // このエンドポイントのURLがclient_idになる // 認可サーバーはこの情報を取得してアプリ設定を把握する

source: // Use globalThis to persist across Next.js hot reloads const globalAuth = globalThis as unknown as { stateStore: Map<string, NodeSavedState>; sessionStore: Map<string, NodeSavedSession>; }; globalAuth.stateStore ??= new Map(); globalAuth.sessionStore ??= new Map();
ja: // Next.jsのホットリロードで消えないよう、globalThisを使います const globalAuth = globalThis as unknown as { stateStore: Map<string, NodeSavedState>; sessionStore: Map<string, NodeSavedSession>; }; globalAuth.stateStore ??= new Map(); globalAuth.sessionStore ??= new Map();

source: // Write the await agent.com.atproto.repo.putRecord({ repo: agent.assertDid, // The user collection: 'xyz.statusphere.status', // The collection rkey, // The record key record: { // The record value status: "👍", createdAt: new Date().toISOString() } }) ```
ja: // 書き込み await agent.com.atproto.repo.putRecord({ repo: agent.assertDid, // ユーザー collection: 'xyz.statusphere.status', // コレクション rkey, // レコードキー record: { // レコード値 status: "👍", createdAt: new Date().toISOString() } }) ```

source: 1. **From the web:** an open, permissionless, and universal network of interconnected content.
ja: 1. **ウェブから**：開かれており、許可不要な、相互接続コンテンツの単一ネットワーク

source: 1. Each user has a data repository. 2. Each repository has collections. 3. Each collection is an ordered K/V store of JSON documents.
ja: 1. 各ユーザーにはデータリポジトリがあります。 2. 各リポジトリにはコレクションがあります。 3. 各コレクションは、JSONドキュメントの順序付けられたK/Vストアです。

source: 1. Historical backfill: Tap fetches the full repo from the account's PDS using com.atproto.sync.getRepo 2. Live event buffering: Any firehose events for this repo during backfill are held in memory 3. Ordering guarantee: Historical events (marked live: false) are delivered first 4. Cutover: After historical events complete, buffered live events are drained 5. Live streaming: New firehose events are delivered immediately (marked live: true)
ja: 1. 履歴バックフィル：Tapはcom.atproto.sync.getRepoを使用して、対象アカウントのPDSから完全なリポジトリをフェッチします。 2. ライブイベントバッファリング：バックフィル中のこのリポジトリのfirehoseイベントはメモリに保持されます。 3. 順序保証：履歴イベント（live: false）が先に配送されます。 4. 切り替え：履歴イベントが完了した後、バッファされたライブイベントが排出されます。 5. ライブストリーミング：新しいfirehoseイベント（live: true）が即座に配信されます。

source: 1. Network takedowns which filter the content from the APIs 2. Labels placed on content by moderation services 3. User controls such as mutes and blocks
ja: 1. APIからコンテンツをフィルタリングする公開停止措置（takedown） 2. モデレーションサービスによってコンテンツに紐付けられるラベル 3. ミュートやブロックなどのユーザーコントロール

source: 2. **From peer-to-peer:** location-independent data, self-certifying data, and skepticism of centralized control of any aspect of the user’s experience.
ja: 2. **P2Pから**：位置に依存しないデータ、自己証明データ、ユーザー体験のあらゆる側面に対する中央集権的支配への懐疑

source: 24 hours
ja: 24時間

source: 2FA Confirmation
ja: 2要素認証の確認

source: 3. **From data-intensive distributed systems:** a splitting of read and write load, application-aware secondary indices to facilitate high-throughput and low latency, streaming canonical data, and the decomposition of monoliths into microservices.
ja: 3. **データ指向分散システムから**：読み取り/書き込み負荷の分離、高スループットと低レイテンシのためのアプリケーション向けセカンダリインデックス、正規データのストリーミング、モノリスからマイクロサービスへの分割

source: 30 days
ja: 30日

source: 7 days
ja: 7日

source: <0>Sign in</0><1> or </1><2>create an account</2><3> </3><4>to search for news, sports, politics, and everything else happening on Bluesky.</4>
ja: <4>ニュース、スポーツ、政治、ほか、Bluesky上で起こっているその他すべてのことを検索するためには</4><0>サインイン</0><1>するか</1><2>アカウントを作成</2><3>してください。</3>

source: <0>You</0> and<1> </1><2>{0} </2>are included in your starter pack
ja: <0>あなた</0>と<1></1><2>{0}</2>はあなたのスターターパックに含まれています

source: <0>{0}, </0><1>{1}, </1>and {2, plural, one {# other} other {# others}} are included in your starter pack
ja: <0>{0}、</0><1>{1}、</1>そして{2, plural, other {他#人}}があなたのスターターパックに含まれています

source: <0>{0}</0> and<1> </1><2>{1} </2>are included in your starter pack
ja: <0>{0}</0>と<2>{1}</2>はあなたのスターターパックに含まれています

source: <0>{0}</0> is included in your starter pack
ja: <0>{0}</0>はあなたのスターターパックに含まれています

source: <0>{0}</0> members
ja: <0>{0}</0>のメンバー

source: <0>{0}</0> {1, plural, one {follower} other {followers}}
ja: <0>{0}</0> {1, plural, other {フォロワー}}

source: <0>{0}</0> {1, plural, one {following} other {following}}
ja: <0>{0}</0> {1, plural, other {フォロー}}

source: <0>{date}</0> at {time}
ja: <0>{date}</0> {time}

source: <ArticleSummary tag="Article" title="ATProto Ethos" href="/articles/atproto-ethos" > A deep dive into the philosophical and aesthetic principles underlying the design of AT Protocol. </ArticleSummary>
ja: <ArticleSummary tag="Article" title="ATプロトコルの理念" href="/articles/atproto-ethos" > ATプロトコルの設計の基礎となる哲学および美学を深く掘り下げます。 </ArticleSummary>

source: <ArticleSummary tag="Article" title="ATProto for distributed systems engineers" href="/articles/atproto-for-distsys-engineers" > In this article we explore AT Proto from the perspective of distributed backend engineering. </ArticleSummary>
ja: <ArticleSummary tag="Article" title="分散システムエンジニアのためのATプロトコル" href="/articles/atproto-for-distsys-engineers" > この記事では、分散バックエンドエンジニアリングの観点からATプロトコルについて説明します。 </ArticleSummary>

source: <ArticleSummary tag="Guide" title="Glossary of terms" href="/guides/glossary" > What's a PDS? an AppView? a DID? If you're feeling a little bowled over by new concepts, give this glossary a look. </ArticleSummary>
ja: <ArticleSummary tag="Guide" title="用語集" href="/guides/glossary" > PDSとは何ですか？AppViewとは？DIDとは？新しい概念に少し戸惑っている場合は、この用語集をご覧ください。 </ArticleSummary>

source: <ArticleSummary tag="Guide" title="The fast intro to building on ATProto" href="/guides/applications" > In this guide, we build a simple multi-user app that publishes your current "status" as an emoji. </ArticleSummary>
ja: <ArticleSummary tag="Guide" title="ATプロトコルでの構築の簡単な入門" href="/guides/applications" > このガイドでは、「ステータス」を絵文字として公開するシンプルなマルチユーザーアプリを構築します。 </ArticleSummary>

source: <ArticleSummary tag="Guide" title="What is Lexicon, and how do I use it to make a schema?" href="/guides/lexicon" > This guide will introduce you to Lexicon and get you started with building your own schemas. </ArticleSummary>
ja: <ArticleSummary tag="Guide" title="Lexiconとは何ですか？また、Lexiconを使用してスキーマを作成する方法を教えてください。" href="/guides/lexicon" > このガイドでは、Lexiconを紹介し、独自のスキーマの構築方法を説明します。 </ArticleSummary>

source: <DescriptionList> <Description title="DIDs">[Decentralized IDs (DIDs)](https://w3c.github.io/did/) identify data repositories. They are broadly used as user IDs, but since every user has one data repository then a DID can be considered a reference to a data repository. The format of a DID varies by the “DID method” used but all DIDs ultimately resolve to a keypair and a list of service providers. This keypair can sign commits to the data repository.</Description> <Description title="CIDs">[Content IDs (CIDs)](https://github.com/multiformats/cid) identify content using a fingerprint hash. They are used throughout the repository to reference the objects (nodes) within it. When a node in the repository changes, its CID also changes. Parents which reference the node must then update their reference, which in turn changes the parent’s CID as well. This chains all the way to the Commit node, which is then signed.</Description> <Description title="NSIDs">[Namespaced Identifiers (NSIDs)](/specs/nsid) identify the Lexicon type for groups of records within a repository.</Description> <Description title="rkey">[Record Keys ("rkeys")](/specs/record-key) identify individual records within a collection in a given repository. The format is specified by the collection Lexicon, with some collections having only a single record with a key like "self", and other collections having many records, with keys using a base32-encoded timestamp called a Timestamp Identifier (TID).</Description> </DescriptionList>
ja: <DescriptionList> <Description title="DID">[分散型識別子（DID）](https://w3c.github.io/did/)はデータリポジトリを識別します。これは広くユーザーIDとして使用されますが、すべてのユーザーが1つのデータリポジトリを持っているため、DIDはデータリポジトリへの参照と見なすことができます。DIDの形式は使用される「DIDメソッド」によって異なりますが、すべてのDIDは最終的に鍵ペアとサービスプロバイダーのリストに解決されます。この鍵ペアは、データリポジトリへのコミットに署名できます。</Description> <Description title="CID">[コンテンツID（CID）](https://github.com/multiformats/cid)は、フィンガープリントハッシュを使用してコンテンツを識別します。これはリポジトリ全体で使用され、リポジトリ内のオブジェクト（ノード）を参照します。リポジトリ内のノードが変更されると、そのCIDも変更されます。ノードを参照する親は参照を更新する必要があり、その結果、親のCIDも変更されます。これはコミットノードまで連鎖し、その後コミットノードが署名されます。</Description> <Description title="NSID">[名前空間識別子（NSID）](/specs/nsid)は、リポジトリ内のレコードグループのLexiconタイプを識別します。</Description> <Description title="rkey">[レコードキー（rkey）](specs/record-key)は、特定のリポジトリ内のコレクションに含まれる個々のレコードを識別します。形式はコレクションのLexiconによって指定されます。レコードを一つだけ持つコレクションは"self"などのキーでレコードを持ったり、多数のレコードを持つコレクションではキーにタイムスタンプ識別子（TID）と呼ばれるbase32エンコードされたタイムスタンプが使用されたりします。</Description> </DescriptionList>

source: <DescriptionList> <Description title="Handles">Handles are DNS names. They are resolved using DNS TXT records or an HTTP well-known endpoint, and must be confirmed by a matching entry in the DID document. Details in the <a href="/specs/handle">Handle specification</a>.</Description> <Description title="DIDs">DIDs are a <a href="https://www.w3.org/TR/did-core/">W3C standard</a> for providing stable & secure IDs. They are used as stable, canonical IDs of users. Details of how they are used in AT Protocol in the <a href="/specs/did">DID specification</a>.</Description> <Description title="DID Documents"> DID Documents are standardized JSON objects which are returned by the DID resolution process. They include the following information: <ul> <li>The handle associated with the DID.</li> <li>The signing key.</li> <li>The URL of the user’s PDS.</li> </ul> </Description> </DescriptionList>
ja: <DescriptionList> <Description title="ハンドル">ハンドルはDNS名です。これらは`com.atproto.identity.resolveHandle` XRPCメソッドを使用して解決され、DIDドキュメント内の一致するエントリによって確認される必要があります。詳細は<a href="/specs/handle">ハンドル仕様</a>をご覧ください。</Description> <Description title="DID">DIDは、安定した安全なIDを提供するための新しい<a href="https://www.w3.org/TR/did-core/">W3C標準</a>です。これは、ユーザーの安定した正規IDとして使用されます。ATプロトコルでの使用方法の詳細については、<a href="/specs/did">DID仕様</a>をご覧ください。</Description> <Description title="DIDドキュメント"> DIDドキュメントは、DIDレジストリによってホストされる標準化されたオブジェクトです。これらには次の情報が含まれます。 <ul> <li>DIDに関連付けられたハンドル</li> <li>署名鍵</li> <li>ユーザーのPDSのURL</li> </ul> </Description> </DescriptionList>

source: <FooterCTA href="/" title="Ready to learn more?" description="Specs, guides, and SDKs can be found here." />
ja: <FooterCTA href="/" title="さらに学習する準備はできましたか？" description="仕様、ガイド、SDK はここにあります。" />

source: <Guides />
ja: <Guides lang="ja" />

source: <Image alt="A diagram illustrating optimistic updates" src={DiagramOptimisticUpdate} />
ja: <Image alt="楽観的更新を示す図" src={DiagramOptimisticUpdate} />

source: <Image alt="A diagram of a repository" src={DiagramRepo} />
ja: <Image alt="リポジトリの図" src={DiagramRepo} />

source: <Image alt="A diagram of the OAuth elements" src={DiagramOauth} />
ja: <Image alt="OAuth要素の図" src={DiagramOauth} />

source: <Image alt="A diagram of the event stream" src={DiagramEventStream} />
ja: <Image alt="イベントストリームの図" src={DiagramEventStream} />

source: <Image alt="A diagram of the flow of information" src={DiagramInfoFlow} />
ja: <Image alt="情報のフロー図" src={DiagramInfoFlow} />

source: <Image alt="A screenshot of our example application" src={AppScreenshot} />
ja: <Image alt="サンプルアプリケーションのスクリーンショット" src={AppScreenshot} />

source: <Image alt="A screenshot of the app status timeline" src={AppStatusHistory} />
ja: <Image alt="アプリのステータスタイムラインのスクリーンショット" src={AppStatusHistory} />

source: <Image alt="A screenshot of the app's status options" src={AppStatusOptions} />
ja: <Image alt="アプリのステータスの選択肢のスクリーンショット" src={AppStatusOptions} />

source: <Image alt="A screenshot of the banner image" src={AppBanner} />
ja: <Image alt="バナー画像のスクリーンショット" src={AppBanner} />

source: <Image alt="A screenshot of the login UI" src={AppLogin} />
ja: <Image alt="ログインUIのスクリーンショット" src={AppLogin} />

source: <ImageCard image={DotMediaInterviewPng} href="https://flipboard.video/w/ophhJTECuL7fcBNbUitV3q" title="Make Identity Central Again, with Bluesky's Jay Graber" tag="Interview" description="An interview between Jay Graber and Flipboard CEO Mike McCue about making social more like the Web." />
ja: <ImageCard image={DotMediaInterviewPng} href="https://flipboard.video/w/ophhJTECuL7fcBNbUitV3q" title="BlueskyのJay Graber氏とともに、アイデンティティを再び中心に据える" tag="Interview" description="Jay Graber氏とFlipboard CEOのMike McCue氏による、ソーシャルをウェブに近づけることについてのインタビュー。" />

source: <ImageCard image={WebWithoutWallsPng} href="https://www.youtube.com/watch?v=F1sJW6nTP6E" title="Web Without Walls - Talk at React Universe 2024" tag="Talk" description="An introduction to the AT Protocol presented by Dan Abramov at React Universe Conf 2024" />
ja: <ImageCard image={WebWithoutWallsPng} href="https://www.youtube.com/watch?v=F1sJW6nTP6E" title="壁のないウェブ - React Universe 2024での講演" tag="Talk" description="React Universe Conf 2024でDan Abramovが発表したATプロトコルの紹介" />

source: <ImageCard image={WhitepaperPng} href="https://arxiv.org/abs/2402.03239" title="Bluesky and the AT Protocol: Usable Decentralized Social Media" tag="Whitepaper" description="A whitepaper authored by Martin Kleppman and the AT Protocol team." />
ja: <ImageCard image={WhitepaperPng} href="https://arxiv.org/abs/2402.03239" title="BlueskyとATプロトコル：使いやすい分散型ソーシャルメディア" tag="Whitepaper" description="Martin KleppmannとATプロトコルチームが執筆したホワイトペーパー。" />
